/* Задайте значение N. Напишите программу, которая выведет
все натуральные числа в промежутке от 1 до N.
N = 5 -> "1, 2, 3, 4, 5"
N = 6 -> "1, 2, 3, 4, 5, 6" */

/* void Rec(int n)
{
    if (n == 0)
    {
        return;
    }
    Rec(n - 1);
    Console.WriteLine(n);
}


Console.WriteLine("Введите N");
int n = int.Parse(Console.ReadLine());

Rec(5);*/
/* Задайте значения M и N. Напишите программу, которая
выведет все натуральные числа в промежутке от M до N.
M = 1; N = 5 -> "1, 2, 3, 4, 5"
M = 4; N = 8 -> "4, 6, 7, 8" */ 


/* void Rec(int n, int m)
{
    if (n == m)
    {
        Console.WriteLine(n);
        return;
    }
    Rec(n - 1, m);
    Console.WriteLine(n);
}


Console.WriteLine("Введите m");
int m = int.Parse(Console.ReadLine());
Console.WriteLine("Введите n");
int n = int.Parse(Console.ReadLine());

Rec(n, m); */