/*  Напишите программу, которая принимает на вход
координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт
номер четверти плоскости, в которой находится эта
точка. */

Console.Writeln("Введите х");
int X = int.Parse(Console.ReadLine());

Console.Writeln("Введите y");
int X = int.Parse(Console.ReadLine());
